# 推广公司  commany_id,  conditions = > params[:order], params[:price], params[:model], params[:district]
# 基于的推广条件的四个参数      也就是满足以下的4个条件当中的某些条件或者组合条件时即推广此公司
# 当推广存在参数:except时      后面的条件不存在于当前查询条件中    推广此公司

# params[:order]    1 => 综合, 2 => 设计, 3 => 施工, 4 => 服务
# params[:model]    1 => 清包, 2 => 半包, 3 => 全包, 4 => 纯设计
# 宁波地区价格区县值
# params[:price]    1 => 6万以下, 2 => 6-10万, 3 => 10-15万, 4 => 30-50万, 5 => 50万以上
# params[:district] 此值存在于HEJIA_TAG表中
# 42378 => 海曙, 42380 => 江北, 42379 => 江东, 42382 => 鄞州, 42381 => 镇海, 42383 => 北仑, 42444 => 慈溪, 42443 => 余姚, 42446 => 宁海, 42445 => 奉化, 42447 => 象山

# 上海地区价格区县值
# params[:price]    1 => 8万以下, 2 => 8-15万, 3 => '15-30万', 4 => '30万-100万', 5 => '100万以上'
# params[:district] 此值存在于HEJIA_TAG表中
# params[:style] 1 => 现代简约,2 => 田园风格,3 => 欧美式,4 => 中式风格,5 => 地中海,6 => 混搭
# 12219 => 闵行
PROMOTED_COMPANIES = {
  'ningbo' => {
    :only => {
      # (原朴 神话= 197425, 255826) conditions （综合)
      {:order => 1} => [197425, 255826],
      #（纳德 无限空间 = 255828, 255851）  conditions （设计)
      {:order => 2} => [255828, 255851],
      #（文康 欧阳 = 256295,255824 ）  conditions （施工)
      {:order => 3} => [256295, 255824],
      # (齐元 易安居 = 256292 256210) conditions （服务)
      {:order => 4} => [256292, 256210],
      #（文康  吉红 = 256295, 256508）  conditions （综合 + 6万以下)
      {:order => 1, :price => 1} => [256295, 256508],
      #（和豫园 博德= 256346, 256352）  conditions （设计 + 6万以下)
      {:order => 2, :price => 1} => [256346, 256352],
      # (合成 万杰  = 256350, 256330) conditions （施工 + 6万以下)
      {:order => 3, :price => 1} => [256350, 256330],
      # (鸿盛  阳丽 = 255853, 196279) conditions （服务 + 6万以下 )
      {:order => 4, :price => 1} => [255853, 196279],
      #（原朴 神话= 197425, 255826）  conditions （综合 + 6-10万)
      {:order => 1, :price => 2} => [197425, 255826],
      #（南鸿 无限空间 = 196338, 255851)  conditions （设计 + 6-10万)
      {:order => 2, :price => 2} => [196338, 255851],
      #（顶艺 纳德 = 256075, 255828）  conditions （施工 + 6-10万)
      {:order => 3, :price => 2} => [256075, 255828],
      #（易安居 荣正 = 256210, 256283）  conditions （服务 + 6-10万)
      {:order => 4, :price => 2} => [256210, 256283],
      #（美之家 欧阳 = 196225, 255824）  conditions （综合 + 10-15万)
      {:order => 1, :price => 3} => [196225, 255824],
      #（神话 纳德 = 255826, 255828)  conditions （设计 + 10-15万)
      {:order => 2, :price => 3} => [255826, 255828],
      #（文康 齐元 = 256295, 256292）  conditions （施工 + 10-15万)
      {:order => 3, :price => 3} => [256295, 256292],
      #（铭邸 顶艺 = 256348, 256075）  conditions （服务 + 10-15万)
      {:order => 4, :price => 3} => [256348, 256075],
      #（洛雅家 鼎峰 = 256270, 256442）  conditions （综合 + 15-30万)
      {:order => 1, :price => 6} => [256270, 256442],
      #（吉红 欧阳 = 256508, 255828)  conditions （设计 + 15-30万)
      {:order => 2, :price => 6} => [256508, 255828],
      #（美之家 顶艺 = 196225, 256075)  conditions （施工 + 15-30万)
      {:order => 3, :price => 6} => [196225, 256075],
      #（易安居  齐元 = 256210, 256292）  conditions （服务 + 15-30万)
      {:order => 4, :price => 6} => [256210, 256292],
      #（纳德 神话 = 255828, 255826）  conditions （综合 + 30-50万)
      {:order => 1, :price => 4} => [255828, 255826],
      #（易安居 齐元 = 256210, 256367)  conditions （设计 + 30-50万)
      {:order => 2, :price => 4} => [256210, 256367],
      #（正博 阳丽= 256414, 196279)  conditions （施工 + 30-50万)
      {:order => 3, :price => 4} => [256414, 196279],
      #（荣正 万杰 = 256283, 256330)  conditions （服务 + 30-50万)
      {:order => 4, :price => 4} => [256283, 256330],
      #（原朴 顶艺 = 197425, 256075）  conditions （综合 + 50万以上)
      {:order => 1, :price => 5} => [197425, 256075],
      #（南鸿 神话 = 196338, 255826）  conditions （设计 + 50万以上)
      {:order => 2, :price => 5} => [196338, 255826],
      #（易安居 欧阳 = 256210, 255824)  conditions （施工 + 50万以上)
      {:order => 3, :price => 5} => [256210, 255824],
      #（美之家 鼎峰 = 196225, 256442)  conditions （服务 + 50万以上)
      {:order => 4, :price => 5} => [196225, 256442],
      #（和豫园 博德 = 256346, 256352)  conditions （综合 + 清包)
      {:order => 1, :model => 1} => [256346, 256352],
      #（万杰 文康 = 256330, 256295）  conditions （设计 + 清包)
      {:order => 2, :model => 1} => [256330, 256295],
      #（合成 甬旺= 256350, 196387）  conditions （施工 + 清包)
      {:order => 3, :model => 1} => [256350, 196387],
      #（纳德 铭邸 = 255828, 256295）  conditions （服务 + 清包)
      {:order => 4, :model => 1} => [255828, 256348],
      #（鸿盛 欧阳 = 255853, 255824)  conditions （综合 + 半包)
      {:order => 1, :model => 2} => [255853, 255824],
      #（纳德 阳丽 = 255828, 196279)  conditions （设计 + 半包)
      {:order => 2, :model => 2} => [255828, 196279],
      #（顶艺 文康 = 256075, 256295）  conditions （施工 + 半包)
      {:order => 3, :model => 2} => [256075, 256295],
      #（原朴 万杰 = 197425, 256330)  conditions （服务 + 半包)
      {:order => 4, :model => 2} => [197425, 256330],
      #（洛雅家 神话 = 256270, 255826）  conditions （综合 + 全包)
      {:order => 1, :model => 3} => [256270, 255826],
      #（荣正 顶艺 = 256283, 256075)  conditions （设计 + 全包)
      {:order => 2, :model => 3} => [256283, 256075],
      #（和豫园 润泽= 256346, 256173)  conditions （施工 + 全包)
      {:order => 3, :model => 3} => [256346, 256173],
      #（鸿盛 甬旺= 255853, 196387)   conditions （服务 + 全包)
      {:order => 4, :model => 3} => [255853, 196387],
      #（铭邸 吉红 = 256348, 256508)  conditions （综合 + 纯设计)
      {:order => 1, :model => 4} => [256348, 256508],
      #（纳德 顶艺 = 255828, 256075)  conditions （设计 + 纯设计)
      {:order => 2, :model => 4} => [255828, 256075],
      #（文康 博德 = 256295, 256352)  conditions （施工 + 纯设计)
      {:order => 3, :model => 4} => [256295, 256352],
      #（易安居 神话 = 256210, 255826）  conditions （服务 + 纯设计)
      {:order => 4, :model => 4} => [256210, 255826],
      # (铭邸 顶艺 = 256348, 256075) conditions （综合 + 现代简约)
      {:order => 1, :style => 1} => [256348, 256075],
      #（美之家 荣正 = 196225, 256283)  conditions （设计 + 现代简约)
      {:order => 2, :style => 1} => [196225, 256283],
      #（原朴 甬旺 = 197425, 196387)  conditions （施工 + 现代简约)
      {:order => 3, :style => 1} => [197425, 196387],
      #（欧阳 易安居 = 255824, 256210）  conditions （服务 + 现代简约)
      {:order => 4, :style => 1} => [255824, 256210],
      # (神话 原朴  = 255826, 197425) conditions （综合 + 田园风格)
      {:order => 1, :style => 2} => [255826, 197425],
      #（博丽 博德  = 256112, 256352)  conditions （设计 + 田园风格)
      {:order => 2, :style => 2} => [256112, 256352],
      #（合成 阳丽= 256350, 196279)  conditions （施工 + 田园风格)
      {:order => 3, :style => 2} => [256350, 196279],
      #（南鸿 顶艺 = 196338, 256075)  conditions （服务 + 田园风格)
      {:order => 4, :style => 2} => [196338, 256075],
      # (正博 齐元 = 256414, 256292) conditions （综合 + 欧美式)
      {:order => 1, :style => 3} => [256414, 256292],
      #（纳德 阳丽 = 255828, 196279)    conditions （设计 + 欧美式)
      {:order => 2, :style => 3} => [255828, 196279],
      #（润泽 文康= 256173, 256295）  conditions （施工 + 欧美式)
      {:order => 3, :style => 3} => [256173, 256295],
      #（百姓 万杰 = 196322, 256330)  conditions （服务 + 欧美式)
      {:order => 4, :style => 3} => [196322, 256330],
      # (合成 欧阳 = 256350, 255824) conditions （综合 + 中式风格)
      {:order => 1, :style => 4} => [256350, 255824],
      #（和豫园 润泽  = 256346, 256173)  conditions （设计 + 中式风格)
      {:order => 2, :style => 4} => [256346, 256173],
      #（鸿盛 博德= 255853, 256352) conditions （施工 + 中式风格)
      {:order => 3, :style => 4} => [255853, 256352],
      #（洛雅家 顶艺 = 256270, 256075)   conditions （服务 + 中式风格)
      {:order => 4, :style => 4} => [256270, 256075],
      # (文康 鼎峰 = 256295, 256442) conditions （综合 + 地中海)
      {:order => 1, :style => 5} => [256295, 256442],
      #（鸿盛 无限空间  = 255853, 255851)   conditions （设计 + 地中海)
      {:order => 2, :style => 5} => [255853, 255851],
      #（正博 齐元 = 256414, 256292)  conditions （施工 + 地中海)
      {:order => 3, :style => 5} => [256414, 256292],
      #（纳德 万杰 = 255828, 256330)  conditions （服务 + 地中海)
      {:order => 4, :style => 5} => [255828, 256330],
      # (鸿盛 无限空间 =255853, 255851) conditions （综合 + 混搭)
      {:order => 1, :style => 6} => [255853, 255851],
      #（美之家 顶艺  = 196225, 256075）   conditions （设计 + 混搭)
      {:order => 2, :style => 6} => [196225, 256075],
      #（原朴 欧阳= 255824, 256348)  conditions （施工 + 混搭)
      {:order => 3, :style => 6} => [255824, 256348],
      #（铭邸 神话 = 256348, 255826)  conditions （服务 + 混搭)
      {:order => 4, :style => 6} => [256348, 255826],
      # (美之家 齐元 = 196225, 256292) conditions （综合 + 海曙)
      {:order => 1, :district => 42378} => [196225, 256292],
      # (顶艺 铭邸 = 256075, 256348) conditions （设计 + 海曙)
      {:order => 2, :district => 42378} => [256075, 256348],
      #(和豫园 万杰 = 256346, 256330)  conditions （施工 + 海曙)
      {:order => 3, :district => 42378} => [256346, 256330],
      #(合成 博德 = 256350, 256352)  conditions （服务 + 海曙)
      {:order => 4, :district => 42378} => [256350, 256352],
      # (正博 吉红  =256414, 256508) conditions （综合 +江北)
      {:order => 1, :district => 42380} => [256414, 256508],
      #(鸿盛 鼎峰  =255853, 256442)   conditions （设计 + 江北)
      {:order => 2, :district => 42380} => [255853, 256442],
      #(博丽 万杰 = 256112, 256330)   conditions （施工 + 江北)
      {:order => 3, :district => 42380} => [256112, 256330],
      #(和豫园 顶艺  = 256346, 256075)   conditions （服务 + 江北)
      {:order => 4, :district => 42380} => [256346, 256075],
      # (无限空间 欧阳  = 255851, 255824) conditions （综合 +江东)
      {:order => 1, :district => 42379} => [255851, 255824],
      #(洛雅家 阳丽  = 256270, 196279)   conditions （设计 + 江东)
      {:order => 2, :district => 42379} => [256270, 196279],
      #(原朴 润泽 = 197425, 256173)   conditions （施工 + 江东)
      {:order => 3, :district => 42379} => [197425, 256173],
      #(正博 神话  = 256414, 255826)   conditions （服务 + 江东)
      {:order => 4, :district => 42379} => [256414, 255826],
      # (易安居 =  256210) conditions （综合 + 鄞州)
      {:order => 1, :district => 42382} => [256210],
      #(鸿盛 博德 = 255853 256352)  conditions （设计 + 鄞州)
      {:order => 2, :district => 42382} => [255853, 256352],
      #(洛雅家 涌居 = 256270, 256507)  conditions （施工 + 鄞州)
      {:order => 3, :district => 42382} => [256270, 256507],
      #(百姓 顶艺 = 196322, 256075)  conditions （服务 + 鄞州)
      {:order => 4, :district => 42382} => [196322, 256075],
      # (百姓 顶艺 = 196322 256075) conditions （综合 + 镇海 )
      {:order => 1, :district => 42381} => [196322, 256075],
      #(欧阳 易安居 = 255824 256210)   conditions （设计 + 镇海)
      {:order => 2, :district => 42381} => [255824, 256210],
      #(纳德 神话 = 255828 255826)   conditions （施工 + 镇海)
      {:order => 3, :district => 42381} => [255828, 255826],
      #(文康 万杰 = 256295 256330)   conditions （服务 + 镇海)
      {:order => 4, :district => 42381} => [256295, 256330],
      # (鸿盛 齐元= 255853, 256292) conditions （综合 + 北仑)
      {:order => 1, :district => 42383} => [255853, 256292],
      #(洛雅家 吉红 = 256270, 256508)  conditions （设计 + 北仑)
      {:order => 2, :district => 42383} => [256270, 256508],
      #(合成 阳丽 = 256350, 196279) conditions （施工 + 北仑)
      {:order => 3, :district => 42383} => [256350, 196279],
      #(鸿盛 甬旺 = 255853, 196387)  conditions （服务 + 北仑)
      {:order => 4, :district => 42383} => [255853, 196387],
      # (和豫园 神话 = 256346, 255826) conditions （综合 + 慈溪)
      {:order => 1, :district => 42444} => [256346, 255826],
      #(齐元 纳德 = 256292, 255828)  conditions （设计 + 慈溪)
      {:order => 2, :district => 42444} => [256292, 255828],
      #(文康 欧阳= 256295, 255824)  conditions （施工 + 慈溪)
      {:order => 3, :district => 42444} => [256295, 255824],
      #(百姓 顶艺 = 196322, 256075)  conditions （服务 + 慈溪)
      {:order => 4, :district => 42444} => [196322, 256075],
      #（南鸿 万杰 = 196338, 256330)  conditions （默认 + 余姚)
      {:order => 1, :district => 42443} => [196338, 256330],
      #（和豫园 博德 = 256346, 256352)  conditions （设计 + 余姚)
      {:order => 2, :district => 42443} => [256346, 256352],
      #（鸿盛 神话 = 255853, 255826) conditions （施工 + 余姚)
      {:order => 3, :district => 42443} => [255853, 255826],
      #（洛雅家 欧阳= 256270, 255824) conditions （服务 + 余姚)
      {:order => 4, :district => 42443} => [256270, 255824],
      #（合成 阳丽 = 256350, 196279)  conditions （ 综合 +宁海)
      {:order => 1, :district => 42446} => [256350, 196279],
      #（无限空间 欧阳 = 255851, 255824)  conditions （设计 + 宁海)
      {:order => 2, :district => 42446} => [255851, 255824],
      #（合成 万杰= 256350, 256330）  conditions （施工 + 宁海)
      {:order => 3, :district => 42446} => [256350, 256330],
      #（南鸿 齐元 = 196338, 256292)  conditions （服务 + 宁海)
      {:order => 4, :district => 42446} => [196338, 256292],
      # (铭邸 欧阳 = 256348, 255824) conditions （综合 + 奉化)
      {:order => 1, :district => 42445} => [256348, 255824],
      #(正博 顶艺 = 256414, 256075)   conditions （设计 + 奉化)
      {:order => 2, :district => 42445} => [256414, 256075],
      #(美之家 神话 = 196225, 255826)   conditions （施工 + 奉化)
      {:order => 3, :district => 42445} => [196225, 255826],
      #(原朴 鼎峰 =197425, 256442)   conditions （服务 + 奉化)
      {:order => 4, :district => 42445} => [197425, 256442],
      #（鼎峰 纳德  = 256442, 255828）  conditions （ 综合 + 象山)
      {:order => 1, :district => 42447} => [256442, 255828],
      #（南鸿 欧阳  = 196338, 255824)  conditions （设计 + 象山)
      {:order => 2, :district => 42447} => [196338, 255824],
      #（博丽 顶艺  = 256112, 256075) conditions （施工 + 象山)
      {:order => 3, :district => 42447} => [256112, 256075],
      #（神话 原朴  = 255826, 197425)  conditions （服务 + 象山)
      {:order => 4, :district => 42447} => [255826, 197425],
      #(文康 万杰  = 256295, 256330)   conditions （6万以下 + 半包 + 综合)
      {:order => 1, :price => 1, :model => 2} => [256295, 256330],
      #(易安居 吉红 = 256210, 256508)   conditions （6万以下 + 半包 + 设计)
      {:order => 2, :price => 1, :model => 2} => [256210, 256508],
      #(正博 甬旺  = 256414, 196387)   conditions （6万以下 + 半包 + 施工)
      {:order => 3, :price => 1, :model => 2} => [256414, 196387],
      #(合成 博德 = 256350, 256352)   conditions （6万以下 + 半包 + 服务)
      {:order => 4, :price => 1, :model => 2} => [256350, 256352],
      #（纳德 欧阳  = 255828, 255824)   conditions （6万-10万 + 半包 + 综合)
      {:order => 1, :price => 2, :model => 2} => [255828, 255824],
      #（阳丽 原朴  = 196279, 197425）   conditions （6万-10万 + 半包 + 设计)
      {:order => 2, :price => 2, :model => 2} => [196279, 197425],
      #（神话 易安居  = 255826, 256210)   conditions （6万-10万 + 半包 + 施工)
      {:order => 3, :price => 2, :model => 2} => [255826, 256210],
      #（铭邸 顶艺 = 256348, 256075)   conditions （6万-10万 + 半包 + 服务)
      {:order => 4, :price => 2, :model => 2} => [256348, 256075],
      #（美之家 顶艺  = 196225, 256075)   conditions （6万-10万 + 全包 + 综合)
      {:order => 1, :price => 2, :model => 3} => [196225, 256075],
      #（纳德 无限空间 = 255828, 255851)   conditions （6万-10万 + 全包 + 设计)
      {:order => 2, :price => 2, :model => 3} => [255828, 255851],
      #（百姓 万杰  = 196322, 256330)   conditions （6万-10万 + 全包 + 施工)
      {:order => 3, :price => 2, :model => 3} => [196322, 256330],
      #（文康 润泽 = 256295, 256173）   conditions （6万-10万 + 全包 + 服务)
      {:order => 4, :price => 2, :model => 3} => [256295, 256173],
      # (百姓 齐元 = 196322, 256292) conditions (现代简约 + 半包 +综合)
      {:order => 1, :model => 2, :style => 1} => [196322, 256292],
      # (原朴 顶艺 = 197425, 256075) conditions (现代简约 + 半包 +设计)
      {:order => 2, :model => 2, :style => 1} => [197425, 256075],
      # (纳德 欧阳 = 255828, 255824) conditions (现代简约 + 半包 +施工)
      {:order => 3, :model => 2, :style => 1} => [255826, 255824],
      # (文康 鼎峰 = 256295, 256442) conditions (现代简约 + 半包 +服务)
      {:order => 4, :model => 2, :style => 1} => [256295, 256442]
    }
  },
  'shanghai' => {
    :only => {
      # (帝涵, 九鼎 = 256335, 256531) conditions (默认)
      {:order => 1} => [256335, 256531],
      # (荣尚, 聚艺 = 227745, 255649) conditions (设计)
      {:order => 2} => [227745, 255649],
      # (友趣, 臻茂 = 141330, 256094) conditions (施工)
      {:order => 3} => [141330, 256094],
      # (同济 = 244265) conditions (服务)
      {:order => 4} => [244265],
      # (沪季, 华风 = 247465, 246205) conditions (8万以下 + 综合)
      {:order => 1, :price => 1} => [247465, 246205],
      # (华风,沪季 =246205,247465) conditions (8万以下 + 设计)
      {:order => 2, :price => 1} => [246205, 247465],
      # (华风,沪季 =246205,247465) conditions (8万以下 + 施工)
      {:order => 3, :price => 1} => [246205, 247465],
      # (华风,沪季 =246205,247465) conditions (8万以下 + 服务)
      {:order => 4, :price => 1} => [246205, 247465],
      # (同济 = 140660) conditions (8-15万 + 综合)
      {:order => 1, :price => 2} => [140660],
      # (同济 = 140660) conditions (8-15万 + 设计)
      {:order => 2, :price => 2} => [140660],
      # (同济 = 140660) conditions (8-15万 + 施工)
      {:order => 3, :price => 2} => [140660],
      # (同济 = 140660) conditions (8-15万 + 服务)
      {:order => 4, :price => 2} => [140660],
      # (华风=246205) conditions ( 综合 + 纯设计)
      {:order => 1, :model => 4} => [246205],      
      # (馨慧=252287) conditions (半包 + 施工)
      {:order => 3, :model => 2} => [252287],
      # (同济 = 140102) conditions (半包 + 8万以下  + 默认)
      {:model => 2, :price => 1, :order => 1} => [140102],
      # (同济 = 140102) conditions (半包 + 8万以下 + 设计)
      {:model => 2, :price => 1, :order => 2} => [140102],
      # (同济 = 140102) conditions (半包 + 8万以下 + 施工)
      {:model => 2, :price => 1, :order => 3} => [140102],
      # (同济 = 140102) conditions (半包 + 8万以下 + 服务)
      {:model => 2, :price => 1, :order => 4} => [140102],
      
      # (申镪 = 140929) conditions (半包 + 8-15万  + 默认)
      {:model => 2, :price => 2, :order => 1} => [140929],
      # (申镪 = 140929) conditions (半包 + 8-15万 + 设计)
      {:model => 2, :price => 2, :order => 2} => [140929],
      # (申镪 = 140929) conditions (半包 + 8-15万 + 施工)
      {:model => 2, :price => 2, :order => 3} => [140929],
      # (申镪 = 140929) conditions (半包 + 8-15万 + 服务)
      {:model => 2, :price => 2, :order => 4} => [140929],
      
      # (华风=246205) conditions ( 设计 + 纯设计)
      {:order => 2, :model => 4} => [246205],
      # (华风=246205) conditions ( 施工 + 纯设计)
      {:order => 3, :model => 4} => [246205],
      # (华风=246205) conditions ( 服务 + 纯设计)
      {:order => 4, :model => 4} => [246205],
      # (点木=256279) conditions ( 闵行 + 设计)
      {:order => 2, :district => 12219} => [256279],
      # (点木=256279) conditions ( 闵行 + 施工)
      {:order => 3, :district => 12219} => [256279],
      # (点木=256279) conditions ( 闵行 + 服务)
      {:order => 4, :district => 12219} => [256279],
      # (青杉=252292) conditions (全包 + 默认)
      {:model => 3, :order => 1} => [252292],
      # (青杉=252292) conditions (全包 + 设计)
      {:model => 3, :order => 2} => [252292],
      # (青杉=252292) conditions (全包 + 施工)
      {:model => 3, :order => 3} => [252292],
      # (青杉=252292) conditions (全包 + 服务)
      {:model => 3, :order => 4} => [252292]
    }
  },
  'suzhou' => {
    :only => {
      # (同济, 骏马 = 256635, 256551) conditions  (综合)
      {:order => 1} => [256635, 256551],
      # {华友， 骏马 = 256432, 256551} conditions (综合 + 8万以下)
      {:order => 1, :price => 1} => [256432, 256551],
      # {易安居， 青庭 = 255714, 255669 } conditions (综合 + 8 -15万)
      {:order => 1, :price => 2} => [255714, 255669],
      #{好时运， 嘉丽美 = 256611, 256552} conditions (综合 + 15 - 30万)
      {:order => 1, :price => 3} => [256611, 256552],
      #{易安居， 华友 = 255714, 256432} conditions (综合 + 30 - 100万)
      {:order => 1, :price => 4} => [255714, 256432],
      #{易安居， 华友 = 255714, 256432} conditions (综合 + 100万以上)
      {:order => 1, :price => 5} => [255714, 256432],
      #{雕刻， 和空间 = 256482， 256153}  conditions( 综合 + 清包)
      {:order => 1, :model => 1} => [256482, 256153],
      #{圆号，雕刻 = 256553, 256482} conditions (综合 + 半包)
      {:order => 1, :model => 2} => [256553, 256482],
      #{华友， 骏马 = 256432, 256551} conditions (综合 + 全包)
      {:order => 1, :model => 3} => [256432, 256551],
      #{雕刻， 圆号 = 256482,256553} conditions (综合 + 纯设计)
      {:order => 1, :model => 4} => [256482, 256553],
      #{易安居， 雕刻 = 255714, 256482 } conditions (综合 + 现代简约)
      {:order => 1, :style => 1} => [255714, 256482],
      #{和空间 + 骏马 = 256153, 256551} conditions (综合 + 欧美式)
      {:order => 1, :style => 3} => [256153, 256551],
      #{凌海， 润祥 = 256140, 255095} conditions (综合 + 中式风格)
      {:order => 1, :style => 4} => [256140, 255095],
      #{同济 ， 青庭 = 256635, 255669} conditions (综合 + 田园风格)
      {:order => 1, :style => 2} => [256635, 255669],
      #{圆号 + 同济 = 256553, 256635} conditions (综合 + 地中海)
      {:order => 1, :style => 5} => [256553, 256635],
      #{嘉丽美， 华友 = 256552, 256432} conditions (综合 + 混搭)
      {:order => 1, :style => 6} => [256552, 256432],
      #{台湾艺境, 嘉丽美 = 256644, 256552} conditions (设计)
      {:order => 2} => [256644, 256552],
      # {大业 , 圆号 = 197220, 256553} conditions (设计 + 8万以下)
      {:order => 2, :price => 1} => [197220, 256553],
      # { 华友 ,润祥 = 256432, 255095 } conditions (设计 + 8 -15)
      {:order => 2, :price => 2} => [256432, 255095],
      # { 圆号,华友  =  256553, 256432} conditions (设计 + 15 - 30)
      {:order => 2, :price => 3} => [256553, 256432],
      # {嘉丽美 ，同济 = 256552, 256635} conditions (设计 + 30 -100)
      {:order => 2, :price => 4} => [256552, 256635],
      # {雕刻 + 嘉丽美 = 256482, 256552} conditions (设计  + 100)
      {:order => 2, :price => 5} => [256482, 256552],
      # {骏马 + 圆号 = 256551, 256553} conditions (设计 + 清包)
      {:order => 2, :model => 1} => [256551, 256553],
      # {菱海 + 大业 = 256140, 197220} conditions (设计 + 半包)
      {:order => 2, :model => 2} => [256140, 197220],
      # {圆号 + 太阳鸟 = 256553, 256609} conditions (设计 + 全包)
      {:order => 2, :model => 3} => [256553, 256609],
      # {好时运 + 菱海 = 256611, 256140} condiitons (设计 + 纯设计)
      {:order => 2, :model => 4} => [256611, 256140],
      # {华友 + 大业 = 256432, 197220} conditions (设计 + 现代简约)
      {:order => 2, :style => 1} => [256432, 197220],
      # {圆号 + 好时运 = 256553, 256611} condiitons (设计 + 欧美式)
      {:order => 2, :style => 3} => [256553, 256611],
      # {华友 + 易安居 = 256432, 255714} condtions (设计 + 中式风格)
      {:order => 2, :style => 4} => [256432, 255714],
      # {华友 + 易安居 = 256432, 255714} condtions (设计 + 田园风格)
      {:order => 2, :style => 2} => [256432, 255714],
      # {雕刻 + 和空间 = 256482, 256153} conditions (设计  + 地中海)
      {:order => 2, :price => 5} => [256482, 256552],
      # {雕刻 + 圆号 = 256482, 256553} conditions (设计  + 混搭)
      {:order => 2, :price => 5} => [256482, 256552],
      # {欧宝 + 太阳鸟 = 257118, 256609} conditions (施工)
      {:order => 3} => [257118, 256609],
      # {好时运 + 同济 = 256611, 256635} conditions (施工 + 8)
      {:order => 3, :price => 1} => [256611, 256635],
      # {嘉丽美 + 好时运 = 256552, 256611} conditions (施工 + 8-15)
      {:order => 3, :price => 2} => [256552, 256611],
      # {太阳鸟 + 同济 = 256609, 256635} conditions (施工 + 15-30)
      {:order => 3, :price => 3} => [256609, 256635], 
      # {圆号， 太阳鸟 = 256553, 256609} condiitons (施工 + 30-100)
      {:order => 3, :price => 4} => [256553, 256609],
      # {好时运 + 润祥 = 256611, 255095} conditions (施工 + 100)
      {:order => 3, :price => 5} => [256611, 255095],
      # {太阳鸟 + 同济 = 256609, 256635} conditions (施工 + 清包)
      {:order => 3, :model => 1} => [256609, 256635],
      # {菱海 + 圆号 = 256140, 256553} conditions (施工 + 半包)
      {:order => 3, :model => 2} => [256140, 256553],
      # {和空间 + 骏马 = 256153, 256551} conditions (施工 + 全包)
      {:order => 3, :model => 3} => [256153, 256551],
      # {大业 + 骏马 = 197220, 256551} conditions (施工 + 纯设计)
      {:order => 3, :model => 4} => [197220, 256551],
      # {易安居 + 嘉丽美 = 255714, 256552} conditions (施工 + 现代简约)
      {:order => 3, :style => 1} => [255714, 256552],
      # {青庭 + 华友 = 255339, 256432} conditions (施工 + 欧美式)
      {:order => 3, :style => 3} => [255339, 256432],
      # {雕刻 + 嘉丽美 = 256482, 256552} conditions (施工 + 中式风格)
      {:order => 3, :style => 4} => [256482, 256552],
      # {润祥 + 青庭 = 255095， 255669} conditions (施工 + 田园风格)
      {:order => 3, :style => 2} => [255095, 255669],
      # [大业 + 骏马 = 197220, 256551] conditions (施工 + 地中海)
      {:order => 3, :style => 5} => [197220, 256551],
      # [太阳鸟 + 同济 = 256609, 256635] conditions (施工 + 混搭)
      {:order => 3, :style => 6} => [256609, 256635],
      # [合壁 + 圆号 = 257087, 256553] conditions (服务)
      {:order => 4} => [257087, 256553],
      # [润祥 + 嘉丽美 = 255095, 256552] conditions (服务 + 8)
      {:order => 4, :price => 1} => [255095, 256552],
      # [同济 + 太阳鸟 = 256635, 256609] conditions (服务 + 8 -15)
      {:order => 4, :price => 2} => [256635, 256609],
      # [菱海 + 易安居 = 256140， 255714] conditions (服务 +  15-30)
      {:order => 4, :price => 3} => [256140, 255714],
      # [圆号 + 太阳鸟 = 256553, 256609] conditions (服务 +  30-100)
      {:order => 4, :price => 4} => [256553, 256609],
      # [大业 + 菱海 = 197220, 256140] conditions (服务 +  100)
      {:order => 4, :price => 5} => [197220, 256140],
      # [润祥 + 骏马 = 255095, 256551] conditions (服务 + 清包)
      {:order => 4, :model => 1} => [255095, 256551],
      # [太阳鸟 + 同济 = 256609, 256635] conditions (服务 + 半包)
      {:order => 4, :model => 2} => [256609, 256635],
      # [大业 + 润祥 = 197220, 255095] conditions (服务 + 全包)
      {:order => 4, :model => 3} => [197220, 255095],
      # [好时运 + 太阳鸟 = 256611, 256609] conditions (服务 + 纯设计)
      {:order => 4, :model => 4} => [256611, 256609],
      # [好时运 + 太阳鸟 = 256611, 256609] conditions (服务 + 现代简约)
      {:order => 4, :style => 1} => [256611, 256609],
      # [雕刻 + 同济 = 256482, 256635] conditions (服务 + 欧美式)
      {:order => 4, :style => 3} => [256482, 256635],
      # [好时运 + 同济 = 256611, 256635] conditions (服务 + 中式风格)
      {:order => 4, :style => 4} => [256611, 256635],
      # [雕刻 + 骏马 = 256482, 256551] conditions (服务 + 田园风格)
      {:order => 4, :style => 2} => [256482, 256551],
      # [好时运 + 青庭 = 256611, 255669] conditions (服务 + 地中海)
      {:order => 4, :style => 5} => [256611, 255669],
      # [好时运 + 润祥 = 256611, 255095] conditions (服务 + 混搭)
      {:order => 4, :style => 6} => [256611, 255095],
      # [艺境 + 中冠 = 256644, 257070] conditions (8万以下 + 半包 + 综合 )
      {:price => 1, :model => 2, :order =>1} => [256644, 257070],
      # [同济 + 暖色调 = 256635, 256676] conditions (8万以下 + 半包 + 设计 )
      {:price => 1, :model => 2, :order =>2} => [256635, 256676],
      # [中冠 + 圆号 = 257070, 256553] conditions (8万以下 + 半包 + 施工 )
      {:price => 1, :model => 2, :order =>3} => [257070, 256553],
      # [青庭 + 骏马 = 255669, 256551] conditions (8万以下 + 半包 + 服务 )
      {:price => 1, :model => 2, :order =>4} => [255669, 256551],
      # [暖色调 + 大业 = 256676, 197220] conditions (8-15万 + 半包 + 综合 )
      {:price => 2, :model => 2, :order =>1} => [256676, 197220],
      # [好时运 + 雕刻 = 256611, 256482] conditions (8-15万 + 半包 + 设计 )
      {:price => 2, :model => 2, :order =>2} => [256611, 256482],
      # [艺境 + 和空间装饰 = 256644, 256153] conditions (8-15万 + 半包 + 施工 )
      {:price => 2, :model => 2, :order =>3} => [256644, 256153],
      # [和空间装饰 + 青庭 = 256153, 255669] conditions (8-15万 + 半包 + 服务 )
      {:price => 2, :model => 2, :order =>4} => [256153, 255669],
      # [好时运 + 嘉丽美 = 256611, 256552] conditions (8-15万 + 全包 + 综合 )
      {:price => 2, :model => 3, :order =>1} => [256611, 256552],
      # [艺境 +嘉丽美 = 256644, 256552] conditions (8-15万 + 全包 + 设计 )
      {:price => 2, :model => 3, :order =>2} => [256644, 256552],
      # [暖色调 + 雕刻 = 256676, 256482] conditions (8-15万 + 全包 + 施工 )
      {:price => 2, :model => 3, :order =>3} => [256676, 256482],
      # [骏马 + 大业 = 256551, 197220] conditions (8-15万 + 全包 + 服务 )
      {:price => 2, :model => 3, :order =>4} => [256551, 197220],
      # [中冠 + 圆号 = 257070, 256553] conditions (现代简约 + 半包 + 综合 )
      {:style => 1, :model => 2, :order =>1} => [257070, 256553],
      # [暖色调 + 华友 = 256676, 256432] conditions (现代简约 + 半包 + 设计 )
      {:style => 1, :model => 2, :order =>2} => [256676, 256432],
      # [同济 + 嘉丽美 = 256635, 256552] conditions (现代简约 + 半包 + 施工 )
      {:style => 1, :model => 2, :order =>3} => [256635, 256552],
      # [嘉丽美 + 圆号 = 256552, 256553] conditions (现代简约 + 半包 + 服务 )
      {:style => 1, :model => 2, :order =>4} => [256552, 256553]
    }
  },
  'wuxi' => {
    :only => {
      # (蓝凯 鹏鑫= 256170, 256451) conditoins (综合)
      {:order => 1} => [256170, 256451],
      # (正大阳光, 摩丹= 256478, 256088) conditoins (设计)
      {:order => 2} => [256478, 256088],
      # (房丽 美, 同济= 256404, 256500) conditions (施工)
      {:order => 3} => [256404, 256500],
      # (白岩 ,世镓 = 256630, 256285) conditions (服务)
      {:order => 4} => [256630, 256285],
      # (鹏鑫, 摩丹 = 256451, 256088) conditoins (综合 + 8万以下)
      {:order => 1, :price => 1} => [256451, 256088],
      # (惠宅，乐饰 = 256254, 256641) conditions (设计 + 8 )
      {:order => 2, :price => 1} => [256254, 256641],
      # (惠宅, 强盛 = 256254, 256643) conditions (施工 + 8)
      {:order => 3, :price => 1} => [256254, 256643],
      # (同济 + 霖荟社 = 256500, 256445) conditions (服务 + 8)
      {:order => 4, :price => 1} => [256500, 256445],
      # (房丽美, 同济 = 256404, 256500) conditoins (综合 + 8-15万)
      {:order => 1, :price => 2} => [256404, 256500],
      # (东韵阁， 强盛 = 257124，256643) conditions (设计 + 8-15)
      {:order => 2, :price => 2} => [257124, 256643],
      # (同济, 白岩 = 256500， 256630) conditions (施工 + 8-15)
      {:order => 3, :price => 2} => [256500, 256630],
      # (超群， 摩丹 = 196167， 256088) conditions (服务 + 8-15)
      {:order => 4, :price => 2} => [196167, 256088],
      # (七签名, 蓝凯 = 256137, 256170) conditoins (综合 + 15-30万)
      {:order => 1, :price => 3} => [256137, 256170],
      # (惠宅， 白岩 = 256254， 256630) conditions (设计 + 15-30)
      {:order => 2, :price => 3} => [256254, 256630],
      # (超群， 正大阳光 = 196167, 256478) conditions (施工 + 15-30)
      {:order => 3, :price => 3} => [196167, 256478],
      # (同济 + 强盛 = 256500, 256643) conditions (服务 + 15-30)
      {:order => 4, :price => 3} => [256500, 256643],
      # (七签名, 世镓 = 256137, 256285) conditoins (综合 + 30-100万)
      {:order => 1, :price => 4} => [256137, 256285],
      # (超群，正大光明 = 196167, 256478) conditoins (设计 + 30-100万)
      {:order => 2, :price => 4} => [196167, 256478],
      # (同济，东韵阁 = 256500, 257124) conditoins (施工 + 30-100万)
      {:order => 3, :price => 4} => [256500, 257124],
      # (东韵阁 = 257124) conditoins (服务 + 30-100万)
      {:order => 4, :price => 4} => [257124],
      # (强盛, 七签名 = 256650, 256137) conditoins (综合 + 100万以上)
      {:order => 1, :price => 5} => [256650, 256137],
      # (同济，东韵阁 = 256500， 257124) conditions (设计 + 100)
      {:order => 2, :price => 5} => [256500, 257124],
      # (元新，摩丹 = 256152， 256088) conditions (施工 + 100)
      {:order => 3, :price => 5} => [256152, 256088],
      # (房丽美，正大光明 = 256404， 256478) conditions (服务 + 100)
      {:order => 4, :price => 5} => [256404, 256478],
      # (七签名 ,丽景  = 256137 ,256219) conditoins (综合 + 清包)
      {:order => 1, :model => 1} => [256137, 256219],
      # (丽景 = 256219) conditoins (设计 + 清包)
      {:order => 2, :model => 1} => [256219],
      # (丽景 = 256219) conditoins (施工 + 清包)
      {:order => 3, :model => 1} => [256219],
      # (丽景 = 256219) conditoins (服务 + 清包)
      {:order => 4, :model => 1} => [256219],
      # (正大, 世镓 = 256478, 256285) conditoins (综合 + 半包)
      {:order => 1, :model => 2} => [256478, 256285],
      # (惠宅，摩丹=256254， 256088) conditions (设计 + 半包)
      {:order => 2, :model => 2} => [256254, 256088],
      # (房丽美，世镓 = 256404, 256285) conditions (施工 + 半包)
      {:order => 3, :model => 2} => [256404, 256285],
      # (鹏鑫，白岩 = 256451， 256630) conditions (服务 + 半包)
      {:order => 4, :model => 2} => [256451, 256630],
      # (蓝凯, 同济 = 256170, 256500) conditoins (综合 + 全包)
      {:order => 1, :model => 3} => [256170, 256500],
      # (惠宅，世镓= 256254，256285) conditions (设计 + 全包)
      {:order => 2, :model => 3} => [256254, 256285],
      # (同济，乐饰 = 256500， 256641) conditions (施工 + 全包)
      {:order => 3, :model => 3} => [256500, 256641],
      # (元新，霖荟社 = 256152，256445) conditions (服务 + 全包)
      {:order => 4, :model => 3} => [256152, 256445],
      # (七签名, 霖荟社 = 256137, 256445) conditoins (综合 + 纯设计)
      {:order => 1, :model => 4} => [256137, 256445],
      # (元新, 世镓 = 256152, 256285) conditoins (综合 + 现代简约)
      {:order => 1, :style => 1} => [256152, 256285],
      # (元新，乐饰 = 256152，256641) conditions (设计 + 现代简约)
      {:order => 2, :style => 1} => [256152, 256641],
      # (同济，强盛 = 256500， 256643) conditions (施工 + 现代简约)
      {:order => 3, :style => 1} => [256500, 256643],
      # (惠宅，七签名=256254， 256137) conditions (服务 + 现代简约)
      {:order => 4, :style => 1} => [256254, 256137],
      # (房丽美, 同济 = 256404, 256500) conditoins (综合 + 欧美式)
      {:order => 1, :style => 3} => [256404, 256500],
      # (超群，东韵阁=196167，257124) conditions (设计 + 欧美式)
      {:order => 2, :style => 3} => [196167, 257124],
      # (惠宅，白岩 = 256254，256630) conditions (施工 + 欧美式)
      {:order => 3, :style => 3} => [256254, 256630],
      # (房丽美，摩丹 = 256404， 256088) conditions (服务 + 欧美式)
      {:order => 4, :style => 3} => [256404, 256088],
      # (乐饰, 霖荟社 = 256641, 256445) conditoins (综合 + 中式风格)
      {:order => 1, :style => 4} => [256641, 256445],
      # (红森林，乐饰=257123，256641) conditions (设计 + 中式风格)
      {:order => 2, :style => 4} => [257123, 256641],
      # (同济，霖荟社 = 256500，256445) conditions (施工 + 中式风格)
      {:order => 3, :style => 4} => [256500, 256445],
      # (鹏鑫，白岩 = 256451， 256630) conditions (服务 + 中射风格)
      {:order => 4, :style => 4} => [256451, 256630],
      # (鹏鑫, 七签名 = 256451, 256137) conditoins (综合 + 田园风格)
      {:order => 1, :style => 2} => [256451, 256137],
      # (同济，白岩 = 256500，256630) conditions (设计 + 田园风格)
      {:order => 2, :style => 2} => [256500, 256630],
      # (房丽美，蓝凯 = 256404， 256170) conditions (施工 + 田园风格)
      {:order => 3, :style => 2} => [256404, 256170],
      # (鹏鑫，红森林 = 256451， 257123) conditions (服务 + 田园风格)
      {:order => 4, :style => 2} => [256451, 257123],
      # (摩丹, 红森林= 256088, 257123) conditoins (综合 + 地中海)
      {:order => 1, :style => 5} => [256088, 257123],
      # (房丽美，霖荟社 = 256404，256445) conditions (设计 + 地中海)
      {:order => 2, :style => 5} => [256404, 256445],
      # (惠宅，强盛 = 256254，256643) conditions (施工 + 地中海)
      {:order => 3, :style => 5} => [256254, 256643],
      # (超群，正大光明 = 196167，256478) conditions (服务 + 地中海)
      {:order => 4, :style => 5} => [196167, 256478],
      # (根艺, 霖荟社 = 257069, 256445) conditoins (综合 + 混搭)
      {:order => 1, :style => 6} => [257069, 256445],
      # (元新，蓝凯 = 256152，256170) conditions (设计 + 混搭)
      {:order => 2, :style => 6} => [256152, 256170],
      # (超群，七签名 = 196167， 256137) conditions (施工 + 混搭)
      {:order => 3, :style => 6} => [196167, 256137],
      # (同济，摩丹 = 256500，256088) conditions (服务 + 混搭)
      {:order => 4, :style => 6} => [256500, 256088], #从这里开始
      # (根艺, 东韵阁 = 257069, 257124) conditoins (综合 + 崇安区)
      {:order => 1, :district => 42346} => [257069, 257124],
      # (房丽美, 强盛 = 256404, 256643 ) conditoins (设计 + 崇安区)
      {:order => 2, :district => 42346} => [256404, 256643],
      # (房丽美, 摩丹 = 256404, 256088 ) conditoins (施工 + 崇安区)
      {:order => 3, :district => 42346} => [256404, 256088],
      # (房丽美, 白岩 = 256404, 256630) conditoins (服务 + 崇安区)
      {:order => 4, :district => 42346} => [256404, 256630],
      # (同济, 正大阳光 = 256500, 256478) conditoins (综合 + 南长区)
      {:order => 1, :district => 42347} => [256500, 256478],
      # (惠宅, 七签名 = 256254, 256137) conditoins (设计 + 南长区)
      {:order => 2, :district => 42347} => [256254, 256137],
      # (同济, 乐饰 = 256500, 256641) conditoins (施工 + 南长区)
      {:order => 3, :district => 42347} => [256500, 256641],
      # (元新, 摩丹 = 256152, 256088) conditoins (服务 + 南长区)
      {:order => 4, :district => 42347} => [256152, 256088],
      # (惠宅, 元新 = 256254, 256152) conditoins (综合 + 北塘区)
      {:order => 1, :district => 42348} => [256254, 256152],
      # (惠宅, 摩丹 = 256254, 256088) conditoins (设计 + 北塘区)
      {:order => 2, :district => 42348} => [256254, 256088],
      # (同济, 白岩 = 256500, 256630) conditoins (施工 + 北塘区)
      {:order => 3, :district => 42348} => [256500, 256630],
      # (鹏鑫, 乐饰 = 256451, 256641) conditoins (服务 + 北塘区)
      {:order => 4, :district => 42348} => [256451, 256641],
      # (摩丹, 世镓= 256088, 256285) conditoins (综合 + 滨湖区)
      {:order => 1, :district => 42349} => [256088, 256285],
      # (同济, 乐饰= 256500, 256641) conditoins (设计 + 滨湖区)
      {:order => 2, :district => 42349} => [256500, 256641],
      # (元新, 正大阳光 = 156152, 256478) conditoins (施工 + 滨湖区)
      {:order => 3, :district => 42349} => [156152, 256478],
      # (房丽美, 白岩= 256404, 256630) conditoins (服务 + 滨湖区)
      {:order => 4, :district => 42349} => [256404, 256630],
      # (超群, 鹏鑫 = 196167, 256451) conditoins (综合 + 锡山区)
      {:order => 1, :district => 42350} => [196167, 256451],
      # (鹏鑫, 白岩 = 256451, 256630) conditoins (设计 + 锡山区)
      {:order => 2, :district => 42350} => [256451, 256630],
      # (超群, 强盛 = 196167, 256643) conditoins (施工 + 锡山区)
      {:order => 3, :district => 42350} => [196167, 256643],
      # (超群, 正大阳光 = 196167, 256478) conditoins (服务 + 锡山区)
      {:order => 4, :district => 42350} => [196167, 256478],
      # (蓝凯, 七签名 = 256170, 256137) conditoins (综合 + 惠山区)
      {:order => 1, :district => 42351} => [256170, 256137],
      # (超群, 正大阳光 = 196167, 256478) conditoins (设计 + 惠山区)
      {:order => 2, :district => 42351} => [196167, 256478],
      # (元鑫, 白岩 = 256152, 256630) conditoins (施工 + 惠山区)
      {:order => 3, :district => 42351} => [256152, 256630],
      # (惠宅, 强盛 = 256254, 256643) conditoins (服务 + 惠山区)
      {:order => 4, :district => 42351} => [256254, 256643],
      # (房丽美, 红森林 = 256404, 257123) conditoins (综合 + 新区)
      {:order => 1, :district => 42352} => [256404, 257123],
      # (惠宅, 强盛 = 256254, 256643) conditoins (设计 + 新区)
      {:order => 2, :district => 42352} => [256254, 256643],
      # (房丽美, 世家 = 256404, 256285) conditoins (施工 + 新区)
      {:order => 3, :district => 42352} => [256404, 256285],
      # (超群, 正大阳光 = 196167, 256478) conditoins (服务 + 新区)
      {:order => 4, :district => 42352} => [196167, 256478],
      # (超群 = 196167 ) conditoins (设计 + 江阴) 
      {:order => 2, :district => 42454} => [196167],
      # (惠宅 = 256254 ) conditoins (施工 + 江阴)
      {:order => 3, :district => 42454} => [256254], 
      # (同济 = 256500 ) conditoins (服务 + 江阴)
      {:order => 4, :district => 42454} => [256500],
      # (惠宅 = 256254) conditoins (设计 + 宜兴) 
      {:order => 2, :district => 42455} => [256254],
      # (房丽美 = 256404) conditoins (施工 + 宜兴)
      {:order => 3, :district => 42455} => [256404],
      # (元鑫 = 256152) conditoins (服务 + 宜兴)
      {:order => 4, :district => 42455} => [256152],
      # (正大阳光,世镓 = 256478, 256285) conditions (8万以下 + 半包 + 综合)
      {:order => 1, :price => 1, :model => 2} => [256478, 256285],
      # (元新， 乐饰 = 256152, 256641) conditions (8万以下 + 半包 + 设计)
      {:order => 2, :price => 1, :model => 2} => [256152, 256641],
      # (惠宅， 白岩 = 256254, 256630) conditions (8万以下 + 半包 + 施工)
      {:order => 3, :price => 1, :model => 2} => [256254, 256630],
      # (房丽美, 强盛 = 256404, 256643) conditions (8万以下 + 半包 + 服务)
      {:order => 4, :price => 1, :model => 2} => [256404, 256643],
      # (鹏鑫, 超群 = 256451, 196167)  conditions (半包 + 8-15万  + 综合)
      {:order => 1, :price => 2, :model => 2} => [256451, 196167],
      # (同济， 强盛 = 256500， 256643)  conditions (半包 + 8-15万 + 设计)
      {:order => 2, :price => 2, :model => 2} => [256500, 256643],
      # (超群，红森林 = 196167，257123)  conditions (半包 + 8-15万 + 施工)
      {:order => 3, :price => 2, :model => 2} => [196167, 257123],
      # (鹏鑫, 乐饰 = 256451, 256641)  conditions (半包 + 8-15万 + 服务)
      {:order => 4, :price => 2, :model => 2} => [256451, 256641],
      # (七签名, 东韵阁 = 256137, 257124 ) conditions (全包 + 8- 15万  + 综合)
      {:order => 1, :price => 2, :model => 3} => [256137, 257124],
      # (惠宅， 摩丹 = 256254, 256088 ) conditions (全包 + 8- 15万 + 设计)
      {:order => 2, :price => 2, :model => 3} => [256254, 256088],
      # (同济，蓝凯 = 256500, 256170) conditions (全包 + 8- 15万 + 施工)
      {:order => 3, :price => 2, :model => 3} => [256500, 256170],
      # (房丽美， 白岩 = 256404, 256630 ) conditions (全包 + 8- 15万 + 服务)
      {:order => 4, :price => 2, :model => 3} => [256404, 256630],
      # (鹏鑫, 房丽美 = 256451, 256404) conditions (现在简约 + 半包  + 综合)
      {:order => 1, :model => 2, :style => 1} => [256451, 256404],
      # (鹏鑫，白岩 = 256451, 256630) conditions (现在简约 + 半包 + 设计)
      {:order => 2, :model => 2, :style => 1} => [256451, 256630],
      # ( 房丽美, 强盛 = 256404, 256643) conditions (现在简约 + 半包 + 施工)
      {:order => 3, :model => 2, :style => 1} => [256404, 256643],
      # (惠宅， 乐饰 = 256254, 256641) conditions (现在简约 + 半包 + 服务)
      {:order => 4, :model => 2, :style => 1} => [256254, 256641],
      
    }
  },
  'hangzhou' => {
    :only => {
      # (世冠 , 百蝠百益  = 256523,256462) conditions (综合)
      {:order => 1} => [256523,256462],
      # (021设计, 百蝠百益=255688, 256462) conditions (设计)
      {:order => 2} => [255688, 256462],
      # (标竿 =255787) conditions  (施工)
      {:order => 3} => [255787],
      # (中博 = 191979) conditions  (服务)
      {:order => 4} => [191979],
      # (聚通 = 256272) conditions (综合 + 8-15万)
      {:order => 1, :price => 2} => [256272],
      # (聚通 = 256272) conditions (设计 + 8-15万)
      {:order => 2, :price => 2} => [256272],
      # (聚通 = 256272) conditions (施工 + 8-15万)
      {:order => 3, :price => 2} => [256272],
      # (聚通 = 256272) conditions (服务 + 8-15万)
      {:order => 4, :price => 2} => [256272],
    },
    :except => {
      # (长和=256303) conditions  (除了设计之外均显示)
      {:order => 2} => [256303]
    }
  }
}

# 第二推荐位公司，规则和PROMOTED_COMPANIES一样。
# 这里推荐的公司显示在PROMOTED_COMPANIES的公司后面。而且不显示页面上的“推”字。
SECONDARY_PROMOTED_COMPANIES = {
=begin
    'shanghai' => {
        :only => {
            # (润泰 = 141049) conditions (8 - 15 + 综合 | 设计 | 施工 | 服务)
            {:order => 1, :price => 2} => [141049],
            {:order => 2, :price => 2} => [141049],
            {:order => 3, :price => 2} => [141049],
            {:order => 4, :price => 2} => [141049],
            # (润泰 = 141049) conditions (嘉定，宝山，青浦，松江，徐汇，闵行，虹口，闸北，杨浦，浦东，南汇，长宁，普陀，静安 || 外加 设计 施工 服务 默认)
            {:order => 1, :district => 12212} => [141049],
            {:order => 2, :district => 12212} => [141049],
            {:order => 3, :district => 12212} => [141049],
            {:order => 4, :district => 12212} => [141049],
            {:order => 1, :district => 12222} => [141049],
            {:order => 2, :district => 12222} => [141049],
            {:order => 3, :district => 12222} => [141049],
            {:order => 4, :district => 12222} => [141049],
            {:order => 1, :district => 12211} => [141049],
            {:order => 2, :district => 12211} => [141049],
            {:order => 3, :district => 12211} => [141049],
            {:order => 4, :district => 12211} => [141049],
            {:order => 1, :district => 12213} => [141049],
            {:order => 2, :district => 12213} => [141049],
            {:order => 3, :district => 12213} => [141049],
            {:order => 4, :district => 12213} => [141049],
            {:order => 1, :district => 12219} => [141049],
            {:order => 2, :district => 12219} => [141049],
            {:order => 3, :district => 12219} => [141049],
            {:order => 4, :district => 12219} => [141049],
            {:order => 1, :district => 12214} => [141049],
            {:order => 2, :district => 12214} => [141049],
            {:order => 3, :district => 12214} => [141049],
            {:order => 4, :district => 12214} => [141049],
            {:order => 1, :district => 12220} => [141049],
            {:order => 2, :district => 12220} => [141049],
            {:order => 3, :district => 12220} => [141049],
            {:order => 4, :district => 12220} => [141049],
            {:order => 1, :district => 12224} => [141049],
            {:order => 2, :district => 12224} => [141049],
            {:order => 3, :district => 12224} => [141049],
            {:order => 4, :district => 12224} => [141049],
            {:order => 1, :district => 12216} => [141049],
            {:order => 2, :district => 12216} => [141049],
            {:order => 3, :district => 12216} => [141049],
            {:order => 4, :district => 12216} => [141049],
            {:order => 1, :district => 12217} => [141049],
            {:order => 2, :district => 12217} => [141049],
            {:order => 3, :district => 12217} => [141049],
            {:order => 4, :district => 12217} => [141049],
            {:order => 1, :district => 12221} => [141049],
            {:order => 2, :district => 12221} => [141049],
            {:order => 3, :district => 12221} => [141049],
            {:order => 4, :district => 12221} => [141049],
            {:order => 1, :district => 12228} => [141049],
            {:order => 2, :district => 12228} => [141049],
            {:order => 3, :district => 12228} => [141049],
            {:order => 4, :district => 12228} => [141049],
            {:order => 1, :district => 12226} => [141049],
            {:order => 2, :district => 12226} => [141049],
            {:order => 3, :district => 12226} => [141049],
            {:order => 4, :district => 12226} => [141049],
            {:order => 1, :district => 12227} => [141049],
            {:order => 2, :district => 12227} => [141049],
            {:order => 3, :district => 12227} => [141049],
            {:order => 4, :district => 12227} => [141049]
        }
     }
=end
}
    
# 装修首页推广信息
INDEX_PROMOTED = {
  'shanghai' => {
    '导航下文字链' => 54729,
    '网友家居秀' => 55156,
    '通告栏' => 55157,
    '热点案例' => 55158,
    '最新更新' => 55159,
    '更多案例' => 55160,
    '装修优惠券' => 54920,
    '专访' => 54733,
    '专题' => 54735,
    '今日最热网友点评' => 55205
  },
  'ningbo' => {
    '导航下文字链' => 54747,
    '网友家居秀' => 55162,
    '通告栏' => 55166,
    '热点案例' => 55170,
    '最新更新' => 55174,
    '更多案例' => 55179,
    '装修优惠券' => 54779,
    '专访' => 55091,
    '专题' => 54743
  },
      
  'hangzhou' => {
    '导航下文字链' => 54738,
    '网友家居秀' => 55161,
    '通告栏' => 55165,
    '热点案例' => 55169,
    '最新更新' => 55173,
    '更多案例' => 55178,
    '装修优惠券' => 54777,
    '专访' => 54741,
    '专题' => 54742
  },
      
  'suzhou' => {
    '导航下文字链' => 54748,
    '网友家居秀' => 55164,
    '通告栏' => 55168,
    '热点案例' => 55172,
    '最新更新' => 55176,
    '更多案例' => 55181,
    '装修优惠券' => 54781,
    '专访' => 54752,
    '专题' => 54753
    
  },
      
  'wuxi' => {
    '导航下文字链' => 54754,
    '网友家居秀' => 55163,
    '通告栏' => 55167,
    '热点案例' => 55171,
    '最新更新' => 55175,
    '更多案例' => 55177,
    '装修优惠券' => 54780,
    '专访' => 54757,
    '专题' => 54750
  }
}

#排行榜页面推广
TOP_PROMOTED = {
  'shanghai' => {
    '上升最快' => 55070,
    '全包' => 54730,
    '半包' => 55071,
    '图片' => 55188
  }
}

# 首页地区部分的推广公司
# 首页优惠券数量
AREA_PROMOTED = {
  '首页友情链接' => {
    'shanghai' => 54720,
    'suzhou' => 54722,
    'ningbo' => 54723,
    'hangzhou' => 54721,
    'wuxi' => 54724
  },
  '热搜公司推广' => {
    'shanghai' => 54008,
    'suzhou' => 54919,
    'ningbo' => 54917,
    'hangzhou' => 54916,
    'wuxi' => 54918
  },
  '首页地区推广公司' => {
    'ningbo' => {
      '海曙' => 55116,
      '江北' => 55117,
      '江东' => 55118,
      '鄞州' => 55119,
      '镇海' => 55120,
      '北仑区' => 55121,
      '慈溪市' => 55122,
      '余姚市' => 55123,
      '宁海县' => 55124,
      '奉化市' => 55125,
      '象山市' => 55126
    }
  },
  # 如果此城市设置数量 则显示设置数量 无则显示默认6
  '首页优惠券数量' => {
    'ningbo' => 36,
    'shanghai' => 24,
    'wuxi' => 24,
    'hangzhou' => 24,
    'suzhou' => 24
  },
  '公司终端页推广' => {
    'ningbo' => 55129
  }
}

#宁波 无锡排行榜加推广公司
THE_CHARTS_PROMOTED = {
  'wuxi' => {
    :price => {
      1 => 55195,
      2 => 55196,
      3 => 55197,
      4 => 55128
    },
    :style => {
      1 => 55198,
      2 => 55199,
      3 => 55200,
      4 => 55201,
      5 => 55202,
      6 => 55203
    }
  },
  'ningbo' => {
    :price => {
      1 => 55116,
      2 => 55117,
      3 => 55118,
      4 => 55119,
      5 => 55087,
      6 => 55126
    },
    :style => {
      1 => 55120,
      2 => 55121,
      3 => 55122,
      4 => 55123,
      5 => 55124,
      6 => 55125
    }
  },
  'suzhou' => {
    :price => {
      1 => 55206,
      2 => 55207,
      3 => 55208,
      4 => 55209
    },
    :style =>{
      1 => 55210,
      2 => 55211,
      3 => 55212,
      4 => 55213,
      5 => 55214,
      6 => 55215
    }
  }
}

DECOFIRM_PROMOTED_DIARY = {
  '日记终端页' => {
    'shanghai' => 55140,
    'ningbo' => 55137,
    'wuxi' => 55138,
    'hangzhou' => 55136,
    'suzhou' => 55139
  },
  '右上角' => {
    'shanghai' => 54732,
    'ningbo' => 54744,
    'wuxi' => 54755,
    'hangzhou' => 54739,
    'suzhou' => 54749
  }
}

FIRMS_LIST_TOP_10 = {
  'shanghai' => [140660,256094,257071]
}

# 各城市广告代码
INDEX_AD_MAPPING = {
  'shanghai' => {
    '大旗1' => 53117,
    '大旗2' => 53119,
    '宽幅1' => 53121,
    '宽幅2' => 53123
  },
  'hangzhou' => {
    '大旗1' => 53141,
    '大旗2' => 53143,
    '宽幅1' => [53145, 54125, 54127, 54129, 54131],
    '宽幅2' => 53147
  },
  'ningbo' => {
    '大旗1' => 55689,
    '大旗2' => 53127,
    '宽幅1' => [53129, 56227, 56229, 56231, 56233],
    '宽幅2' => [53131, 53917, 53919, 53921, 53923]
  },
  'suzhou' => {
    '大旗1' => 53103,
    '大旗2' => [53105, 54717, 54719],
    '宽幅1' => [53169, 53171, 53173, 53175, 53177],
    '宽幅2' => 53109
  },
  'wuxi' => {
    '大旗1' => 53133,
    '大旗2' => 53135,
    '宽幅1' => [53151, 53153, 53155, 53157, 53159],
    '宽幅2' => 53139
  }
}

#d.51hejia.com 首页的推广信息
D_HOME_INDEX = {
  'shanghai' => {
    "首页装修日记" => 55131
   },
   'hangzhou' => {
     "首页装修日记" => 55134
   },
   'ningbo' => {
     "首页装修日记" => 55132
   },
   'suzhou' => {
     "首页装修日记" => 55133
   },
   'wuxi' => {
     "首页装修日记" => 55135
   }
}
